# GetRelatedElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLevelInfo..::..GetRelatedElements Method
IFCLevelInfo Class See Also
---
Gets all building elements on this level.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<IFCAnyHandle> GetRelatedElements()
```

Visual Basic
---
```text
Public Function GetRelatedElements As ICollection(Of IFCAnyHandle)
```

Visual C++
---
```text
public:
ICollection<IFCAnyHandle^>^ GetRelatedElements()
```

# ### Return Value
The collection of elements.
# See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace